---
kind: property
id: P:Autodesk.Revit.DB.BeamSystem.Direction
source: html/8eccbd73-eb9b-7eaa-2449-d1bcfc0a8e84.htm
---
# Autodesk.Revit.DB.BeamSystem.Direction Property

The Direction of the BeamSystem.

## Syntax (C#)
```csharp
public XYZ Direction { get; }
```